# YOLOv8n baseline，ARD 版：只替换 P3/8、P4/16 两个 stride=2 下采样为 A2DGLUConv
# 这是你之前 mAP50≈0.72 的配置

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,       [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv,       [128, 3, 2]]         # 1-P2/4
  - [-1, 3, C2f,        [128, True]]         # 2
  - [-1, 1, A2DGLUConv, [256, 3, 2]]         # 3-P3/8 (Conv → A2D)
  - [-1, 6, C2f,        [256, True]]         # 4
  - [-1, 1, A2DGLUConv, [512, 3, 2]]         # 5-P4/16 (Conv → A2D)
  - [-1, 3, C2f,        [512, True]]         # 6
  - [-1, 1, A2DGLUConv,       [512, 3, 2]]         # 7-P5/32
  - [-1, 1, SPPF,       [512, 5]]            # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9 up: P5->P4
  - [[-1, 6], 1, Concat, [1]]                    # 10 cat P4
  - [-1, 3, C2f,        [256]]                   # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 up: P4->P3
  - [[-1, 4], 1, Concat, [1]]                    # 13 cat P3
  - [-1, 3, C2f,        [128]]                   # 14 (P3/8-small)

  - [-1, 1, Conv,       [256, 3, 2]]             # 15 down: P3->P4
  - [[-1, 11], 1, Concat, [1]]                   # 16 cat head P4
  - [-1, 3, C2f,        [256]]                   # 17 (P4/16-medium)

  - [-1, 1, Conv,       [512, 3, 2]]             # 18 down: P4->P5
  - [[-1, 8], 1, Concat, [1]]                    # 19 cat head P5
  - [-1, 3, C2f,        [512]]                   # 20 (P5/32-large)

  - [[14, 17, 20], 1, Detect, [nc]]              # 21 Detect(P3,P4,P5)
