# yolov8n_rgcu.yaml

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

# ============ Backbone ============ #
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]       # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]      # 1-P2/4
  - [-1, 3, C2f, [128, True]]       # 2
  - [-1, 1, Conv, [256, 3, 2]]      # 3-P3/8
  - [-1, 6, C2f, [256, True]]       # 4
  - [-1, 1, Conv, [512, 3, 2]]      # 5-P4/16
  - [-1, 3, C2f, [512, True]]       # 6
  - [-1, 1, SPPF, [512, 5]]         # 7-P5/32

# ============ Head (替换上采样为 RGCU) ============ #
head:
  - [-1, 1, RGCU, [256]]            # 8 (P5 -> P4)
  - [[-1, 4], 1, Concat, [1]]       # 9
  - [-1, 3, C2f, [256]]             # 10

  - [-1, 1, RGCU, [128]]            # 11 (P4 -> P3)
  - [[-1, 2], 1, Concat, [1]]       # 12
  - [-1, 3, C2f, [128]]             # 13 (P3输出)

  - [-1, 1, Conv, [256, 3, 2]]      # 14
  - [[-1, 10], 1, Concat, [1]]      # 15
  - [-1, 3, C2f, [256]]             # 16 (P4输出)

  - [-1, 1, Conv, [512, 3, 2]]      # 17
  - [[-1, 7], 1, Concat, [1]]       # 18
  - [-1, 3, C2f, [512]]             # 19 (P5输出)

  - [[13, 16, 19], 1, Detect, [nc]] # 20 Detect(P3, P4, P5)
