nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv,       [64, 3, 2]]          # 0
  - [-1, 1, Conv,       [128, 3, 2]]         # 1
  - [-1, 3, C2f,        [128, True]]         # 2  (P3/4)
  - [-1, 1, A2DGLUConv, [256, 3, 2]]         # 3  -> stride 8
  - [-1, 6, C2f,        [256, True]]         # 4  (P3, stride 8)
  - [-1, 1, A2DGLUConv, [512, 3, 2]]         # 5  -> stride 16
  - [-1, 3, C2f,        [512, True]]         # 6  (P4, stride 16)
  - [-1, 1, A2DGLUConv, [512, 3, 2]]         # 7  -> stride 32
  - [-1, 1, SPPF,       [512, 5]]            # 8  (P5, stride 32)

head:
  # P5 -> P4：Upsample + CLAG，并与 baseline 并联
  - [ 8,  1, nn.Upsample, [None, 2, "nearest"]]   # 9  up_p5 (-> stride 16)
  - [[6, 9, 6], 1, CLAG, [256, 256, 256]]         # 10 guided_p4  (S=P4=6, Mdeep=9, Mshallow=6)
  - [[9, 6], 1, Concat, [1]]                      # 11 baseline cat (16x)
  - [-1, 3, C2f, [256]]                           # 12 p4_baseline
  - [[10, 12], 1, Concat, [1]]                    # 13
  - [-1, 3, C2f, [256]]                           # 14 P4_refined (stride 16)

  # P4 -> P3：Upsample + CLAG，并与 baseline 并联
  - [ 14, 1, nn.Upsample, [None, 2, "nearest"]]   # 15 up_p4 (-> stride 8)
  - [[4, 15, 4], 1, CLAG, [128, 128, 128]]        # 16 guided_p3  (S=P3=4, Mdeep=15, Mshallow=4)
  - [[15, 4], 1, Concat, [1]]                     # 17 baseline cat (8x)
  - [-1, 3, C2f, [128]]                           # 18 p3_baseline
  - [[16, 18], 1, Concat, [1]]                    # 19
  - [-1, 3, C2f, [128]]                           # 20 P3_out (stride 8)

  # 下行聚合
  - [-1, 1, Conv, [256, 3, 2]]                    # 21  P3->P4 (->16)
  - [[-1, 14], 1, Concat, [1]]                    # 22  cat P4_refined
  - [-1, 3, C2f, [256]]                           # 23  P4_out

  - [-1, 1, Conv, [512, 3, 2]]                    # 24  P4->P5 (->32)
  - [[-1, 8], 1, Concat, [1]]                     # 25  cat P5 backbone
  - [-1, 3, C2f, [512]]                           # 26  P5_out

  - [[20, 23, 26], 1, Detect, [nc]]               # 27 Detect(P3,P4,P5)
