# yolov8n_ard_rgcu_clag.yaml

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv,       [64, 3, 2]]      # 0
  - [-1, 1, A2DGLUConv, [128, 3, 2]]     # 1
  - [-1, 1, A2DGLUConv, [128, 3, 2]]     # 2
  - [-1, 3, C2f,        [128, True]]     # 3  (P3)
  - [-1, 1, A2DGLUConv, [256, 3, 2]]     # 4
  - [-1, 6, C2f,        [256, True]]     # 5  (P4)
  - [-1, 1, A2DGLUConv, [512, 3, 2]]     # 6
  - [-1, 3, C2f,        [512, True]]     # 7
  - [-1, 1, SPPF,       [512, 5]]        # 8  (P5)

head:
  # ====== P5 -> P4：先 RGCU 上采样，再送入 CLAG（串联） ======
  - [ 8, 1, RGCU,        [256] ]               # 9  up_p5_by_rgcu, (B,256,H4,W4)
  - [[5, 9, 5], 1, CLAG, [256, 256, 256]]      # 10 guided_p4_by_clag (S=P4, Mdeep=up_rgcu, Mshallow=P4)

  # baseline 分支（保持你原来的 RGCU→Concat→C2f）
  - [[9, 5], 1, Concat,  [1]]                  # 11
  - [-1, 3, C2f,         [256]]                # 12 p4_baseline

  # 并联融合（图里右侧的 concat→c2f）
  - [[10, 12], 1, Concat, [1]]                 # 13
  - [-1, 3, C2f,         [256]]                # 14 P4_refined

  # ====== P4 -> P3：同样“先 RGCU，再 CLAG”，并与 baseline 并联 ======
  - [ 14, 1, RGCU,       [128] ]               # 15 up_p4_by_rgcu
  - [[3, 15, 3], 1, CLAG, [128, 128, 128]]     # 16 guided_p3_by_clag (S=P3, Mdeep=up_rgcu, Mshallow=P3)

  # baseline 分支（原 RGCU→Concat→C2f）
  - [[15, 3], 1, Concat, [1]]                  # 17
  - [-1, 3, C2f,         [128]]                # 18 p3_baseline

  # 并联融合输出 P3
  - [[16, 18], 1, Concat, [1]]                 # 19
  - [-1, 3, C2f,         [128]]                # 20 P3_out

  # ====== 下行聚合恢复到 P4, P5（与原结构一致） ======
  - [-1, 1, Conv,        [256, 3, 2]]          # 21
  - [[-1, 14], 1, Concat, [1]]                 # 22
  - [-1, 3, C2f,         [256]]                # 23 P4_out

  - [-1, 1, Conv,        [512, 3, 2]]          # 24
  - [[-1, 8], 1, Concat, [1]]                  # 25
  - [-1, 3, C2f,         [512]]                # 26 P5_out

  - [[20, 23, 26], 1, Detect, [nc]]            # 27
