# yolov8n_ard_rgcu.yaml

nc: 6
depth_multiple: 0.33
width_multiple: 0.25

backbone:
  - [-1, 1, Conv,       [64, 3, 2]]      # 0
  - [-1, 1, Conv,       [128, 3, 2]]     # 1
  - [-1, 1, A2DGLUConv, [128, 3, 2]]     # 2
  - [-1, 3, C2f,        [128, True]]     # 3
  - [-1, 1, A2DGLUConv, [256, 3, 2]]     # 4
  - [-1, 6, C2f,        [256, True]]     # 5
  - [-1, 1, Conv,       [512, 3, 2]]     # 6
  - [-1, 3, C2f,        [512, True]]     # 7
  - [-1, 1, SPPF,       [512, 5]]        # 8

head:
  - [-1, 1, RGCU,       [256]]           # 9
  - [[-1, 5], 1, Concat, [1]]            # 10 ← 注意：5是P4
  - [-1, 3, C2f,        [256]]           # 11

  - [-1, 1, RGCU,       [128]]           # 12
  - [[-1, 3], 1, Concat, [1]]            # 13 ← 注意：3是P3
  - [-1, 3, C2f,        [128]]           # 14  (P3输出)

  - [-1, 1, Conv,       [256, 3, 2]]     # 15
  - [[-1, 11], 1, Concat, [1]]           # 16
  - [-1, 3, C2f,        [256]]           # 17  (P4输出)

  - [-1, 1, Conv,       [512, 3, 2]]     # 18
  - [[-1, 8], 1, Concat, [1]]            # 19
  - [-1, 3, C2f,        [512]]           # 20  (P5输出)

  - [[14, 17, 20], 1, Detect, [nc]]      # 21
